function binarySearch(array, value) {
  let low = 0;
  let high = array.length; // Границы поиска по индексам
  let count = 0;

  while (low <= high) {
    count++;
    let mid = Math.floor((low + high) / 2); // среднее значение, индекс элемента
    let tempValue = array[mid]; // сам элемент, по индексу среднего элемента

    if (typeof tempValue === "number") {
      if (tempValue === value) {
        return [mid, count];
      } else if (tempValue < value) {
        // если среднее значение меньше переданного то ищи во второй половине
        count++;
        low = mid + 1;
      } else if (tempValue > value) {
        count++;
        high = mid - 1;
      }
    }

    if (typeof tempValue === "string") {
      if (tempValue === value) {
        return [mid, count];
      } else if (tempValue.localeCompare(value) === -1) {
        // если среднее значение меньше переданного то ищи во второй половине
        low = mid + 1;
      } else if (tempValue.localeCompare(value) === 1) {
        high = mid - 1;
      }
    }
  }
  return "Значение не найдено";
}
function binarySearch2(array, value) {
  let low = 0;
  let high = array.length - 1;
  let count = 0;

  while (low <= high) {
    debugger;
    count++;
    let mid = Math.floor((low + high) / 2);
    let tempValue = array[mid]; // Получаем значение свойства code текущего объекта

    if (tempValue === value) {
      debugger;
      return [mid, count];
    } else if (tempValue < value) {
      low = mid + 1;
    } else if (tempValue > value) {
      high = mid - 1;
    }
  }
  return -1;
}
const array = [1, 5, 8, 12, 16, 19, 34, 56, 77, 79, 89, 90, 100];
const cities = [
  {
    text: "Абакан",
    id: "Абакан",
  },
  {
    text: "Абинск",
    id: "Абинск",
  },
  {
    text: "Авдеевка",
    id: "Авдеевка",
  },
  {
    text: "Адлер",
    id: "Адлер",
  },
  {
    text: "Азов",
    id: "Азов",
  },
  {
    text: "Аксай",
    id: "Аксай",
  },
  {
    text: "Алапаевск",
    id: "Алапаевск",
  },
  {
    text: "Алатырь",
    id: "Алатырь",
  },
  {
    text: "Алдан",
    id: "Алдан",
  },
  {
    text: "Алейск",
    id: "Алейск",
  },
  {
    text: "Александрия",
    id: "Александрия",
  },
  {
    text: "Александров",
    id: "Александров",
  },
  {
    text: "Александровка",
    id: "Александровка",
  },
  {
    text: "Александровск",
    id: "Александровск",
  },
  {
    text: "Александровск-Сахалинский",
    id: "Александровск-Сахалинский",
  },
  {
    text: "Александровское",
    id: "Александровское",
  },
  {
    text: "Алексеевка",
    id: "Алексеевка",
  },
  {
    text: "Алексин",
    id: "Алексин",
  },
  {
    text: "Алупка",
    id: "Алупка",
  },
  {
    text: "Алушта",
    id: "Алушта",
  },
  {
    text: "Алчевск",
    id: "Алчевск",
  },
  {
    text: "Альметьевск",
    id: "Альметьевск",
  },
  {
    text: "Амвросиевка",
    id: "Амвросиевка",
  },
  {
    text: "Амурск",
    id: "Амурск",
  },
  {
    text: "Анадырь",
    id: "Анадырь",
  },
  {
    text: "Анапа",
    id: "Анапа",
  },
  {
    text: "Ангарск",
    id: "Ангарск",
  },
  {
    text: "Анжеро-Судженск",
    id: "Анжеро-Судженск",
  },
  {
    text: "Анива",
    id: "Анива",
  },
  {
    text: "Анна",
    id: "Анна",
  },
  {
    text: "Антрацит",
    id: "Антрацит",
  },
  {
    text: "Апатиты",
    id: "Апатиты",
  },
  {
    text: "Апрелевка",
    id: "Апрелевка",
  },
  {
    text: "Арбузинка",
    id: "Арбузинка",
  },
  {
    text: "Арзамас",
    id: "Арзамас",
  },
  {
    text: "Арзгир",
    id: "Арзгир",
  },
  {
    text: "Армавир",
    id: "Армавир",
  },
  {
    text: "Армянск",
    id: "Армянск",
  },
  {
    text: "Арсеньев",
    id: "Арсеньев",
  },
  {
    text: "Артем",
    id: "Артем",
  },
  {
    text: "Артёмовск",
    id: "Артёмовск",
  },
  {
    text: "Артемовский",
    id: "Артемовский",
  },
  {
    text: "Архангельск",
    id: "Архангельск",
  },
  {
    text: "Асбест",
    id: "Асбест",
  },
  {
    text: "Астрахань",
    id: "Астрахань",
  },
  {
    text: "Аткарск",
    id: "Аткарск",
  },
  {
    text: "Ахтырка",
    id: "Ахтырка",
  },
  {
    text: "Ачинск",
    id: "Ачинск",
  },
  {
    text: "Аша",
    id: "Аша",
  },
  {
    text: "Аэропорт Домодедово",
    id: "Аэропорт Домодедово",
  },
  {
    text: "Бабаево",
    id: "Бабаево",
  },
  {
    text: "Багаевский",
    id: "Багаевский",
  },
  {
    text: "Байконур",
    id: "Байконур",
  },
  {
    text: "Балабаново",
    id: "Балабаново",
  },
  {
    text: "Балаклея",
    id: "Балаклея",
  },
  {
    text: "Балаково",
    id: "Балаково",
  },
  {
    text: "Балахна",
    id: "Балахна",
  },
  {
    text: "Балашиха",
    id: "Балашиха",
  },
  {
    text: "Балашов",
    id: "Балашов",
  },
  {
    text: "Баргузин",
    id: "Баргузин",
  },
  {
    text: "Барнаул",
    id: "Барнаул",
  },
  {
    text: "Барышевка",
    id: "Барышевка",
  },
  {
    text: "Батайск",
    id: "Батайск",
  },
  {
    text: "Бахмач",
    id: "Бахмач",
  },
  {
    text: "Бахчисарай",
    id: "Бахчисарай",
  },
  {
    text: "Баштанка",
    id: "Баштанка",
  },
  {
    text: "Белая Калитва",
    id: "Белая Калитва",
  },
  {
    text: "Белая Церковь",
    id: "Белая Церковь",
  },
  {
    text: "Белгород",
    id: "Белгород",
  },
  {
    text: "Белгород-Днестровский",
    id: "Белгород-Днестровский",
  },
  {
    text: "Белово",
    id: "Белово",
  },
  {
    text: "Белогорск",
    id: "Белогорск",
  },
  {
    text: "Белозёрка",
    id: "Белозёрка",
  },
  {
    text: "Белокуракино",
    id: "Белокуракино",
  },
  {
    text: "Белорецк",
    id: "Белорецк",
  },
  {
    text: "Белореченск",
    id: "Белореченск",
  },
  {
    text: "Беляевка",
    id: "Беляевка",
  },
  {
    text: "Бердичев",
    id: "Бердичев",
  },
  {
    text: "Бердск",
    id: "Бердск",
  },
  {
    text: "Бердянск",
    id: "Бердянск",
  },
  {
    text: "Берегово",
    id: "Берегово",
  },
  {
    text: "Бережаны",
    id: "Бережаны",
  },
  {
    text: "Березники",
    id: "Березники",
  },
  {
    text: "Березовка",
    id: "Березовка",
  },
  {
    text: "Березовский",
    id: "Березовский",
  },
  {
    text: "Березовский",
    id: "Березовский",
  },
  {
    text: "Беслан",
    id: "Беслан",
  },
  {
    text: "Беспятное",
    id: "Беспятное",
  },
  {
    text: "Бийск",
    id: "Бийск",
  },
  {
    text: "Биробиджан",
    id: "Биробиджан",
  },
  {
    text: "Бирск",
    id: "Бирск",
  },
  {
    text: "Благовещенск",
    id: "Благовещенск",
  },
  {
    text: "Благодарный",
    id: "Благодарный",
  },
  {
    text: "Близнюки",
    id: "Близнюки",
  },
  {
    text: "Бобров",
    id: "Бобров",
  },
  {
    text: "Богданович",
    id: "Богданович",
  },
  {
    text: "Богодухов",
    id: "Богодухов",
  },
  {
    text: "Богородск",
    id: "Богородск",
  },
  {
    text: "Богородчаны",
    id: "Богородчаны",
  },
  {
    text: "Богуслав",
    id: "Богуслав",
  },
  {
    text: "Богучар",
    id: "Богучар",
  },
  {
    text: "Бодайбо",
    id: "Бодайбо",
  },
  {
    text: "Болград",
    id: "Болград",
  },
  {
    text: "Болехов",
    id: "Болехов",
  },
  {
    text: "Бологое",
    id: "Бологое",
  },
  {
    text: "Большой Камень",
    id: "Большой Камень",
  },
  {
    text: "Бор",
    id: "Бор",
  },
  {
    text: "Борислав",
    id: "Борислав",
  },
  {
    text: "Борисоглебск",
    id: "Борисоглебск",
  },
  {
    text: "Борисполь",
    id: "Борисполь",
  },
  {
    text: "Боровичи",
    id: "Боровичи",
  },
  {
    text: "Боровск",
    id: "Боровск",
  },
  {
    text: "Бородянка",
    id: "Бородянка",
  },
  {
    text: "Боярка",
    id: "Боярка",
  },
  {
    text: "Братск",
    id: "Братск",
  },
  {
    text: "Бровары",
    id: "Бровары",
  },
  {
    text: "Броды",
    id: "Броды",
  },
  {
    text: "Бронницы",
    id: "Бронницы",
  },
  {
    text: "Брянка",
    id: "Брянка",
  },
  {
    text: "Брянск",
    id: "Брянск",
  },
  {
    text: "Буденновск",
    id: "Буденновск",
  },
  {
    text: "Бузулук",
    id: "Бузулук",
  },
  {
    text: "Буйнакск",
    id: "Буйнакск",
  },
  {
    text: "Бурштын",
    id: "Бурштын",
  },
  {
    text: "Бурынь",
    id: "Бурынь",
  },
  {
    text: "Бутурлиновка",
    id: "Бутурлиновка",
  },
  {
    text: "Буча",
    id: "Буча",
  },
  {
    text: "Бучач",
    id: "Бучач",
  },
  {
    text: "Валки",
    id: "Валки",
  },
  {
    text: "Валуйки",
    id: "Валуйки",
  },
  {
    text: "Ванино",
    id: "Ванино",
  },
  {
    text: "Варва",
    id: "Варва",
  },
  {
    text: "Васильков",
    id: "Васильков",
  },
  {
    text: "Великая Лепетиха",
    id: "Великая Лепетиха",
  },
  {
    text: "Великие Луки",
    id: "Великие Луки",
  },
  {
    text: "Великий Берёзный",
    id: "Великий Берёзный",
  },
  {
    text: "Великий Новгород",
    id: "Великий Новгород",
  },
  {
    text: "Великий Устюг",
    id: "Великий Устюг",
  },
  {
    text: "Вельск",
    id: "Вельск",
  },
  {
    text: "Верхний Уфалей",
    id: "Верхний Уфалей",
  },
  {
    text: "Верхняя Пышма",
    id: "Верхняя Пышма",
  },
  {
    text: "Верхняя Салда",
    id: "Верхняя Салда",
  },
  {
    text: "Веселый",
    id: "Веселый",
  },
  {
    text: "Вешенская",
    id: "Вешенская",
  },
  {
    text: "Взморье",
    id: "Взморье",
  },
  {
    text: "Видное",
    id: "Видное",
  },
  {
    text: "Вилково",
    id: "Вилково",
  },
  {
    text: "Вилючинск",
    id: "Вилючинск",
  },
  {
    text: "Винница",
    id: "Винница",
  },
  {
    text: "Виноградов",
    id: "Виноградов",
  },
  {
    text: "Вихоревка",
    id: "Вихоревка",
  },
  {
    text: "Вишнёвое",
    id: "Вишнёвое",
  },
  {
    text: "Владивосток",
    id: "Владивосток",
  },
  {
    text: "Владикавказ",
    id: "Владикавказ",
  },
  {
    text: "Владимир",
    id: "Владимир",
  },
  {
    text: "Владимир-Волынский",
    id: "Владимир-Волынский",
  },
  {
    text: "Внуково",
    id: "Внуково",
  },
  {
    text: "Вознесенск",
    id: "Вознесенск",
  },
  {
    text: "Волгоград",
    id: "Волгоград",
  },
  {
    text: "Волгодонск",
    id: "Волгодонск",
  },
  {
    text: "Волжск",
    id: "Волжск",
  },
  {
    text: "Волжский",
    id: "Волжский",
  },
  {
    text: "Вологда",
    id: "Вологда",
  },
  {
    text: "Волоколамск",
    id: "Волоколамск",
  },
  {
    text: "Волоконовка",
    id: "Волоконовка",
  },
  {
    text: "Волосово",
    id: "Волосово",
  },
  {
    text: "Волочиск",
    id: "Волочиск",
  },
  {
    text: "Волхов",
    id: "Волхов",
  },
  {
    text: "Волчанск",
    id: "Волчанск",
  },
  {
    text: "Вольно-Надеждинское",
    id: "Вольно-Надеждинское",
  },
  {
    text: "Вольногорск",
    id: "Вольногорск",
  },
  {
    text: "Вольск",
    id: "Вольск",
  },
  {
    text: "Воркута",
    id: "Воркута",
  },
  {
    text: "Воробьевка",
    id: "Воробьевка",
  },
  {
    text: "Воронеж",
    id: "Воронеж",
  },
  {
    text: "Воронеж",
    id: "Воронеж",
  },
  {
    text: "Воскресенск",
    id: "Воскресенск",
  },
  {
    text: "Воскресенское",
    id: "Воскресенское",
  },
  {
    text: "Воткинск",
    id: "Воткинск",
  },
  {
    text: "Всеволожск",
    id: "Всеволожск",
  },
  {
    text: "Вурнары",
    id: "Вурнары",
  },
  {
    text: "Выборг",
    id: "Выборг",
  },
  {
    text: "Выкса",
    id: "Выкса",
  },
  {
    text: "Вырица",
    id: "Вырица",
  },
  {
    text: "Выселки",
    id: "Выселки",
  },
  {
    text: "Высокий",
    id: "Высокий",
  },
  {
    text: "Вышгород",
    id: "Вышгород",
  },
  {
    text: "Вышний Волочек",
    id: "Вышний Волочек",
  },
  {
    text: "Вязовая",
    id: "Вязовая",
  },
  {
    text: "Вязьма",
    id: "Вязьма",
  },
  {
    text: "Вятские Поляны",
    id: "Вятские Поляны",
  },
  {
    text: "Гаврилов-ям",
    id: "Гаврилов-ям",
  },
  {
    text: "Гагарин",
    id: "Гагарин",
  },
  {
    text: "Гадяч",
    id: "Гадяч",
  },
  {
    text: "Гай",
    id: "Гай",
  },
  {
    text: "Галенки",
    id: "Галенки",
  },
  {
    text: "Галич",
    id: "Галич",
  },
  {
    text: "Гатчина",
    id: "Гатчина",
  },
  {
    text: "Геленджик",
    id: "Геленджик",
  },
  {
    text: "Геническ",
    id: "Геническ",
  },
  {
    text: "Георгиевск",
    id: "Георгиевск",
  },
  {
    text: "Глазов",
    id: "Глазов",
  },
  {
    text: "Глыбокая",
    id: "Глыбокая",
  },
  {
    text: "Голая Пристань",
    id: "Голая Пристань",
  },
  {
    text: "Голицыно",
    id: "Голицыно",
  },
  {
    text: "Горловка",
    id: "Горловка",
  },
  {
    text: "Горно-Алтайск",
    id: "Горно-Алтайск",
  },
  {
    text: "Горнозаводск",
    id: "Горнозаводск",
  },
  {
    text: "Городенка",
    id: "Городенка",
  },
  {
    text: "Городец",
    id: "Городец",
  },
  {
    text: "Городище",
    id: "Городище",
  },
  {
    text: "Городок",
    id: "Городок",
  },
  {
    text: "Городок",
    id: "Городок",
  },
  {
    text: "Гремячинск",
    id: "Гремячинск",
  },
  {
    text: "Грозный",
    id: "Грозный",
  },
  {
    text: "Грязовец",
    id: "Грязовец",
  },
  {
    text: "Губаха",
    id: "Губаха",
  },
  {
    text: "Губкин",
    id: "Губкин",
  },
  {
    text: "Гудермес",
    id: "Гудермес",
  },
  {
    text: "Гуково",
    id: "Гуково",
  },
  {
    text: "Гулькевичи",
    id: "Гулькевичи",
  },
  {
    text: "Гуляйполе",
    id: "Гуляйполе",
  },
  {
    text: "Гусиноозерск",
    id: "Гусиноозерск",
  },
  {
    text: "Гусь Хрустальный",
    id: "Гусь Хрустальный",
  },
  {
    text: "Далматово",
    id: "Далматово",
  },
  {
    text: "Дальнегорск",
    id: "Дальнегорск",
  },
  {
    text: "Дальнереченск",
    id: "Дальнереченск",
  },
  {
    text: "Дебальцево",
    id: "Дебальцево",
  },
  {
    text: "Дедовск",
    id: "Дедовск",
  },
  {
    text: "Демидово",
    id: "Демидово",
  },
  {
    text: "Деражня",
    id: "Деражня",
  },
  {
    text: "Дергачи",
    id: "Дергачи",
  },
  {
    text: "Десна",
    id: "Десна",
  },
  {
    text: "Десногорск",
    id: "Десногорск",
  },
  {
    text: "Джанкой",
    id: "Джанкой",
  },
  {
    text: "Дзержинск",
    id: "Дзержинск",
  },
  {
    text: "Дзержинск",
    id: "Дзержинск",
  },
  {
    text: "Дзержинский",
    id: "Дзержинский",
  },
  {
    text: "Дивногорск",
    id: "Дивногорск",
  },
  {
    text: "Дивное",
    id: "Дивное",
  },
  {
    text: "Димитров",
    id: "Димитров",
  },
  {
    text: "Димитровград",
    id: "Димитровград",
  },
  {
    text: "Дмитров",
    id: "Дмитров",
  },
  {
    text: "Днепродзержинск",
    id: "Днепродзержинск",
  },
  {
    text: "Днепропетровск",
    id: "Днепропетровск",
  },
  {
    text: "Днепрорудное",
    id: "Днепрорудное",
  },
  {
    text: "Добромиль",
    id: "Добромиль",
  },
  {
    text: "Доброполье",
    id: "Доброполье",
  },
  {
    text: "Добрянка",
    id: "Добрянка",
  },
  {
    text: "Докучаевск",
    id: "Докучаевск",
  },
  {
    text: "Долгопрудный",
    id: "Долгопрудный",
  },
  {
    text: "Домодедово",
    id: "Домодедово",
  },
  {
    text: "Донецк",
    id: "Донецк",
  },
  {
    text: "Донецк",
    id: "Донецк",
  },
  {
    text: "Дрогобыч",
    id: "Дрогобыч",
  },
  {
    text: "Дружковка",
    id: "Дружковка",
  },
  {
    text: "Дубна",
    id: "Дубна",
  },
  {
    text: "Дубовка",
    id: "Дубовка",
  },
  {
    text: "Дубровица",
    id: "Дубровица",
  },
  {
    text: "Дудинка",
    id: "Дудинка",
  },
  {
    text: "Дунаевцы",
    id: "Дунаевцы",
  },
  {
    text: "Евпатория",
    id: "Евпатория",
  },
  {
    text: "Егорлык",
    id: "Егорлык",
  },
  {
    text: "Егорлыкская",
    id: "Егорлыкская",
  },
  {
    text: "Егорьевск",
    id: "Егорьевск",
  },
  {
    text: "Ейск",
    id: "Ейск",
  },
  {
    text: "Екатеринбург",
    id: "Екатеринбург",
  },
  {
    text: "Елабуга",
    id: "Елабуга",
  },
  {
    text: "Елань",
    id: "Елань",
  },
  {
    text: "Елец",
    id: "Елец",
  },
  {
    text: "Елизово",
    id: "Елизово",
  },
  {
    text: "Еманжелинск",
    id: "Еманжелинск",
  },
  {
    text: "Емильчино",
    id: "Емильчино",
  },
  {
    text: "Енакиево",
    id: "Енакиево",
  },
  {
    text: "Ерофей-Павлович",
    id: "Ерофей-Павлович",
  },
  {
    text: "Ессентуки",
    id: "Ессентуки",
  },
  {
    text: "Ефремов",
    id: "Ефремов",
  },
  {
    text: "Железноводск",
    id: "Железноводск",
  },
  {
    text: "Железногорск",
    id: "Железногорск",
  },
  {
    text: "Железногорск",
    id: "Железногорск",
  },
  {
    text: "Железногорск-Илимский",
    id: "Железногорск-Илимский",
  },
  {
    text: "Железнодорожный",
    id: "Железнодорожный",
  },
  {
    text: "Жёлтые Воды",
    id: "Жёлтые Воды",
  },
  {
    text: "Жигулевск",
    id: "Жигулевск",
  },
  {
    text: "Жидачов",
    id: "Жидачов",
  },
  {
    text: "Жирновск",
    id: "Жирновск",
  },
  {
    text: "Житомир",
    id: "Житомир",
  },
  {
    text: "Жолква",
    id: "Жолква",
  },
  {
    text: "Жуковка",
    id: "Жуковка",
  },
  {
    text: "Жуковский",
    id: "Жуковский",
  },
  {
    text: "Забайкальск",
    id: "Забайкальск",
  },
  {
    text: "Заволжье",
    id: "Заволжье",
  },
  {
    text: "Зазимье",
    id: "Зазимье",
  },
  {
    text: "Заполярный",
    id: "Заполярный",
  },
  {
    text: "Запорожье",
    id: "Запорожье",
  },
  {
    text: "Зарайск",
    id: "Зарайск",
  },
  {
    text: "Заречное",
    id: "Заречное",
  },
  {
    text: "Заречный",
    id: "Заречный",
  },
  {
    text: "Заринск",
    id: "Заринск",
  },
  {
    text: "Збараж",
    id: "Збараж",
  },
  {
    text: "Звенигород",
    id: "Звенигород",
  },
  {
    text: "Здолбунов",
    id: "Здолбунов",
  },
  {
    text: "Зеленогорск",
    id: "Зеленогорск",
  },
  {
    text: "Зеленоград",
    id: "Зеленоград",
  },
  {
    text: "Зеленокумск",
    id: "Зеленокумск",
  },
  {
    text: "Зерноград",
    id: "Зерноград",
  },
  {
    text: "Зима",
    id: "Зима",
  },
  {
    text: "Зимовники",
    id: "Зимовники",
  },
  {
    text: "Златоуст",
    id: "Златоуст",
  },
  {
    text: "Змиёв",
    id: "Змиёв",
  },
  {
    text: "Знаменка",
    id: "Знаменка",
  },
  {
    text: "Золотоноша",
    id: "Золотоноша",
  },
  {
    text: "Золочев",
    id: "Золочев",
  },
  {
    text: "Ивано-Франковск",
    id: "Ивано-Франковск",
  },
  {
    text: "Иваново",
    id: "Иваново",
  },
  {
    text: "Ивантеевка",
    id: "Ивантеевка",
  },
  {
    text: "Ижевск",
    id: "Ижевск",
  },
  {
    text: "Измаил",
    id: "Измаил",
  },
  {
    text: "Изобильный",
    id: "Изобильный",
  },
  {
    text: "Изюм",
    id: "Изюм",
  },
  {
    text: "Изяслав",
    id: "Изяслав",
  },
  {
    text: "Иланский",
    id: "Иланский",
  },
  {
    text: "Иловля",
    id: "Иловля",
  },
  {
    text: "Ильичёвск",
    id: "Ильичёвск",
  },
  {
    text: "Инжавино",
    id: "Инжавино",
  },
  {
    text: "Инта",
    id: "Инта",
  },
  {
    text: "Ипатово",
    id: "Ипатово",
  },
  {
    text: "Иркутск",
    id: "Иркутск",
  },
  {
    text: "Ирпень",
    id: "Ирпень",
  },
  {
    text: "Иршава",
    id: "Иршава",
  },
  {
    text: "Искитим",
    id: "Искитим",
  },
  {
    text: "Истра",
    id: "Истра",
  },
  {
    text: "Ичня",
    id: "Ичня",
  },
  {
    text: "Ишимбай",
    id: "Ишимбай",
  },
  {
    text: "Йошкар-Ола",
    id: "Йошкар-Ола",
  },
  {
    text: "Кабанск",
    id: "Кабанск",
  },
  {
    text: "Кавалерово",
    id: "Кавалерово",
  },
  {
    text: "Кагальницкая",
    id: "Кагальницкая",
  },
  {
    text: "Кагарлык",
    id: "Кагарлык",
  },
  {
    text: "Казанская",
    id: "Казанская",
  },
  {
    text: "Казань",
    id: "Казань",
  },
  {
    text: "Казатин",
    id: "Казатин",
  },
  {
    text: "Казлук",
    id: "Казлук",
  },
  {
    text: "Калач",
    id: "Калач",
  },
  {
    text: "Калач-на-дону",
    id: "Калач-на-дону",
  },
  {
    text: "Калининград",
    id: "Калининград",
    code: "kaliningrad",
  },
  {
    text: "Калиновка",
    id: "Калиновка",
  },
  {
    text: "Калтан",
    id: "Калтан",
  },
  {
    text: "Калуга",
    id: "Калуга",
  },
  {
    text: "Калуш",
    id: "Калуш",
  },
  {
    text: "Калязин",
    id: "Калязин",
  },
  {
    text: "Каменец-Подольский",
    id: "Каменец-Подольский",
  },
  {
    text: "Каменка",
    id: "Каменка",
  },
  {
    text: "Каменка Бугская",
    id: "Каменка Бугская",
  },
  {
    text: "Каменка-Днепровская",
    id: "Каменка-Днепровская",
  },
  {
    text: "Каменоломни",
    id: "Каменоломни",
  },
  {
    text: "Каменск-Уральский",
    id: "Каменск-Уральский",
  },
  {
    text: "Каменск-Шахтинский",
    id: "Каменск-Шахтинский",
  },
  {
    text: "Камень-Рыболов",
    id: "Камень-Рыболов",
  },
  {
    text: "Камышин",
    id: "Камышин",
  },
  {
    text: "Канаш",
    id: "Канаш",
  },
  {
    text: "Кандалакша",
    id: "Кандалакша",
  },
  {
    text: "Канев",
    id: "Канев",
  },
  {
    text: "Каневская",
    id: "Каневская",
  },
  {
    text: "Канск",
    id: "Канск",
  },
  {
    text: "Кантемировка",
    id: "Кантемировка",
  },
  {
    text: "Карабаш",
    id: "Карабаш",
  },
  {
    text: "Карагай",
    id: "Карагай",
  },
  {
    text: "Карловка",
    id: "Карловка",
  },
  {
    text: "Касимов",
    id: "Касимов",
  },
  {
    text: "Каспийск",
    id: "Каспийск",
  },
  {
    text: "Катеринополь",
    id: "Катеринополь",
  },
  {
    text: "Каховка",
    id: "Каховка",
  },
  {
    text: "Качканар",
    id: "Качканар",
  },
  {
    text: "Кашары",
    id: "Кашары",
  },
  {
    text: "Кашира",
    id: "Кашира",
  },
  {
    text: "Кегичёвка",
    id: "Кегичёвка",
  },
  {
    text: "Кельменцы",
    id: "Кельменцы",
  },
  {
    text: "Кемерово",
    id: "Кемерово",
  },
  {
    text: "Керчь",
    id: "Керчь",
  },
  {
    text: "Киев",
    id: "Киев",
  },
  {
    text: "Кизел",
    id: "Кизел",
  },
  {
    text: "Кизляр",
    id: "Кизляр",
  },
  {
    text: "Килия",
    id: "Килия",
  },
  {
    text: "Кимры",
    id: "Кимры",
  },
  {
    text: "Кинель",
    id: "Кинель",
  },
  {
    text: "Кинешма",
    id: "Кинешма",
  },
  {
    text: "Киржач",
    id: "Киржач",
  },
  {
    text: "Кириллов",
    id: "Кириллов",
  },
  {
    text: "Кириши",
    id: "Кириши",
  },
  {
    text: "Киров",
    id: "Киров",
  },
  {
    text: "Кировград",
    id: "Кировград",
  },
  {
    text: "Кирово-Чепецк",
    id: "Кирово-Чепецк",
  },
  {
    text: "Кировоград",
    id: "Кировоград",
  },
  {
    text: "Кировск",
    id: "Кировск",
  },
  {
    text: "Кировск",
    id: "Кировск",
  },
  {
    text: "Кировский",
    id: "Кировский",
  },
  {
    text: "Кировское",
    id: "Кировское",
  },
  {
    text: "Киселевск",
    id: "Киселевск",
  },
  {
    text: "Кисловодск",
    id: "Кисловодск",
  },
  {
    text: "Кицмань",
    id: "Кицмань",
  },
  {
    text: "Клевань",
    id: "Клевань",
  },
  {
    text: "Климовск",
    id: "Климовск",
  },
  {
    text: "Клин",
    id: "Клин",
  },
  {
    text: "Ковель",
    id: "Ковель",
  },
  {
    text: "Ковров",
    id: "Ковров",
  },
  {
    text: "Когалым",
    id: "Когалым",
  },
  {
    text: "Кодинск",
    id: "Кодинск",
  },
  {
    text: "Козелец",
    id: "Козелец",
  },
  {
    text: "Козова",
    id: "Козова",
  },
  {
    text: "Кола",
    id: "Кола",
  },
  {
    text: "Коломна",
    id: "Коломна",
  },
  {
    text: "Коломыя",
    id: "Коломыя",
  },
  {
    text: "Кольчугино",
    id: "Кольчугино",
  },
  {
    text: "Комсомольск",
    id: "Комсомольск",
  },
  {
    text: "Комсомольск-на-Амуре",
    id: "Комсомольск-на-Амуре",
  },
  {
    text: "Комсомольское",
    id: "Комсомольское",
  },
  {
    text: "Конаково",
    id: "Конаково",
  },
  {
    text: "Кондопога",
    id: "Кондопога",
  },
  {
    text: "Конотоп",
    id: "Конотоп",
  },
  {
    text: "Константиновка",
    id: "Константиновка",
  },
  {
    text: "Константиновск",
    id: "Константиновск",
  },
  {
    text: "Копейск",
    id: "Копейск",
  },
  {
    text: "Коркино",
    id: "Коркино",
  },
  {
    text: "Королев",
    id: "Королев",
  },
  {
    text: "Королёво",
    id: "Королёво",
  },
  {
    text: "Коростень",
    id: "Коростень",
  },
  {
    text: "Корсаков",
    id: "Корсаков",
  },
  {
    text: "Корсунь-Шевченковский",
    id: "Корсунь-Шевченковский",
  },
  {
    text: "Коряжма",
    id: "Коряжма",
  },
  {
    text: "Косов",
    id: "Косов",
  },
  {
    text: "Костополь",
    id: "Костополь",
  },
  {
    text: "Кострома",
    id: "Кострома",
  },
  {
    text: "Котельники",
    id: "Котельники",
  },
  {
    text: "Котельниково",
    id: "Котельниково",
  },
  {
    text: "Котово",
    id: "Котово",
  },
  {
    text: "Котовск",
    id: "Котовск",
  },
  {
    text: "Котовск",
    id: "Котовск",
  },
  {
    text: "Коцюбинское",
    id: "Коцюбинское",
  },
  {
    text: "Краматорск",
    id: "Краматорск",
  },
  {
    text: "Красилов",
    id: "Красилов",
  },
  {
    text: "Красноармейск",
    id: "Красноармейск",
  },
  {
    text: "Красноармейск",
    id: "Красноармейск",
  },
  {
    text: "Красновишерск",
    id: "Красновишерск",
  },
  {
    text: "Красногорск",
    id: "Красногорск",
  },
  {
    text: "Красноград",
    id: "Красноград",
  },
  {
    text: "Краснодар",
    id: "Краснодар",
  },
  {
    text: "Краснодон",
    id: "Краснодон",
  },
  {
    text: "Краснознаменск",
    id: "Краснознаменск",
  },
  {
    text: "Краснокаменск",
    id: "Краснокаменск",
  },
  {
    text: "Краснокамск",
    id: "Краснокамск",
  },
  {
    text: "Краснокутск",
    id: "Краснокутск",
  },
  {
    text: "Красноперекопск",
    id: "Красноперекопск",
  },
  {
    text: "Краснотурьинск",
    id: "Краснотурьинск",
  },
  {
    text: "Красноуральск",
    id: "Красноуральск",
  },
  {
    text: "Красноуфимск",
    id: "Красноуфимск",
  },
  {
    text: "Красноярск",
    id: "Красноярск",
  },
  {
    text: "Красный Лиман",
    id: "Красный Лиман",
  },
  {
    text: "Красный Луч",
    id: "Красный Луч",
  },
  {
    text: "Красный Сулин",
    id: "Красный Сулин",
  },
  {
    text: "Красный Яр",
    id: "Красный Яр",
  },
  {
    text: "Кременец",
    id: "Кременец",
  },
  {
    text: "Кременная",
    id: "Кременная",
  },
  {
    text: "Кременчуг",
    id: "Кременчуг",
  },
  {
    text: "Кривой Рог",
    id: "Кривой Рог",
  },
  {
    text: "Кролевец",
    id: "Кролевец",
  },
  {
    text: "Крымск",
    id: "Крымск",
  },
  {
    text: "Кстово",
    id: "Кстово",
  },
  {
    text: "Куанда",
    id: "Куанда",
  },
  {
    text: "Кудымкар",
    id: "Кудымкар",
  },
  {
    text: "Кузнецк",
    id: "Кузнецк",
  },
  {
    text: "Кузнецовск",
    id: "Кузнецовск",
  },
  {
    text: "Куйбышев",
    id: "Куйбышев",
  },
  {
    text: "Кулебаки",
    id: "Кулебаки",
  },
  {
    text: "Кумертау",
    id: "Кумертау",
  },
  {
    text: "Кунгур",
    id: "Кунгур",
  },
  {
    text: "Купавна",
    id: "Купавна",
  },
  {
    text: "Купянск",
    id: "Купянск",
  },
  {
    text: "Курагино",
    id: "Курагино",
  },
  {
    text: "Курахово",
    id: "Курахово",
  },
  {
    text: "Курган",
    id: "Курган",
  },
  {
    text: "Курганинск",
    id: "Курганинск",
  },
  {
    text: "Курсавка",
    id: "Курсавка",
  },
  {
    text: "Курск",
    id: "Курск",
  },
  {
    text: "Курчатов",
    id: "Курчатов",
  },
  {
    text: "Кушва",
    id: "Кушва",
  },
  {
    text: "Кызыл",
    id: "Кызыл",
    code: "kyzyl",
  },
  {
    text: "Кыштым",
    id: "Кыштым",
  },
  {
    text: "Лабытнанги",
    id: "Лабытнанги",
  },
  {
    text: "Лангепас",
    id: "Лангепас",
  },
  {
    text: "Лебедин",
    id: "Лебедин",
  },
  {
    text: "Лебедянь",
    id: "Лебедянь",
  },
  {
    text: "Левокумское",
    id: "Левокумское",
  },
  {
    text: "Лениногорск",
    id: "Лениногорск",
  },
  {
    text: "Ленинск",
    id: "Ленинск",
  },
  {
    text: "Ленинск-Кузнецкий",
    id: "Ленинск-Кузнецкий",
  },
  {
    text: "Ленск",
    id: "Ленск",
  },
  {
    text: "Лермонтов",
    id: "Лермонтов",
  },
  {
    text: "Лесной",
    id: "Лесной",
  },
  {
    text: "Лесозаводск",
    id: "Лесозаводск",
  },
  {
    text: "Лесосибирск",
    id: "Лесосибирск",
  },
  {
    text: "Летичев",
    id: "Летичев",
  },
  {
    text: "Летняя Ставка",
    id: "Летняя Ставка",
  },
  {
    text: "Лиманское",
    id: "Лиманское",
  },
  {
    text: "Линево",
    id: "Линево",
  },
  {
    text: "Липецк",
    id: "Липецк",
  },
  {
    text: "Лисичанск",
    id: "Лисичанск",
  },
  {
    text: "Лиски",
    id: "Лиски",
  },
  {
    text: "Лобня",
    id: "Лобня",
  },
  {
    text: "Лозовая",
    id: "Лозовая",
  },
  {
    text: "Лосино-Петровский",
    id: "Лосино-Петровский",
  },
  {
    text: "Лубны",
    id: "Лубны",
  },
  {
    text: "Луга",
    id: "Луга",
  },
  {
    text: "Луганск",
    id: "Луганск",
  },
  {
    text: "Лугины",
    id: "Лугины",
  },
  {
    text: "Лутугино",
    id: "Лутугино",
  },
  {
    text: "Луховицы",
    id: "Луховицы",
  },
  {
    text: "Луцк",
    id: "Луцк",
  },
  {
    text: "Лучегорск",
    id: "Лучегорск",
  },
  {
    text: "Лысково",
    id: "Лысково",
  },
  {
    text: "Лысьва",
    id: "Лысьва",
  },
  {
    text: "Лыткарино",
    id: "Лыткарино",
  },
  {
    text: "Львов",
    id: "Львов",
  },
  {
    text: "Люберцы",
    id: "Люберцы",
  },
  {
    text: "Магадан",
    id: "Магадан",
  },
  {
    text: "Магнитогорск",
    id: "Магнитогорск",
  },
  {
    text: "Майкоп",
    id: "Майкоп",
  },
  {
    text: "Макаров",
    id: "Макаров",
  },
  {
    text: "Макеевка",
    id: "Макеевка",
  },
  {
    text: "Малаховка",
    id: "Малаховка",
  },
  {
    text: "Малин",
    id: "Малин",
  },
  {
    text: "Малоярославец",
    id: "Малоярославец",
  },
  {
    text: "Мамаевцы",
    id: "Мамаевцы",
  },
  {
    text: "Марганец",
    id: "Марганец",
  },
  {
    text: "Мариинск",
    id: "Мариинск",
  },
  {
    text: "Мариуполь",
    id: "Мариуполь",
  },
  {
    text: "Марковка",
    id: "Марковка",
  },
  {
    text: "Маркс",
    id: "Маркс",
  },
  {
    text: "Матвеев Курган",
    id: "Матвеев Курган",
  },
  {
    text: "Махачкала",
    id: "Махачкала",
  },
  {
    text: "Мегион",
    id: "Мегион",
  },
  {
    text: "Медвежьегорск",
    id: "Медвежьегорск",
  },
  {
    text: "Медногорск",
    id: "Медногорск",
  },
  {
    text: "Междуреченск",
    id: "Междуреченск",
  },
  {
    text: "Мелитополь",
    id: "Мелитополь",
  },
  {
    text: "Менделеево",
    id: "Менделеево",
  },
  {
    text: "Менделеевск",
    id: "Менделеевск",
  },
  {
    text: "Мерефа",
    id: "Мерефа",
  },
  {
    text: "Миасс",
    id: "Миасс",
  },
  {
    text: "Микунь",
    id: "Микунь",
  },
  {
    text: "Миллерово",
    id: "Миллерово",
  },
  {
    text: "Минеральные Воды",
    id: "Минеральные Воды",
  },
  {
    text: "Минусинск",
    id: "Минусинск",
  },
  {
    text: "Миргород",
    id: "Миргород",
  },
  {
    text: "Мирный",
    id: "Мирный",
  },
  {
    text: "Мирный",
    id: "Мирный",
  },
  {
    text: "Михайловка",
    id: "Михайловка",
  },
  {
    text: "Михайловка",
    id: "Михайловка",
  },
  {
    text: "Михнево",
    id: "Михнево",
  },
  {
    text: "Мичуринск",
    id: "Мичуринск",
  },
  {
    text: "Могилёв-Подольский",
    id: "Могилёв-Подольский",
  },
  {
    text: "Могоча",
    id: "Могоча",
  },
  {
    text: "Можайск",
    id: "Можайск",
  },
  {
    text: "Можга",
    id: "Можга",
  },
  {
    text: "Молодогвардейск",
    id: "Молодогвардейск",
  },
  {
    text: "Мончегорск",
    id: "Мончегорск",
  },
  {
    text: "Морозовск",
    id: "Морозовск",
  },
  {
    text: "Москва",
    id: "Москва",
    code: "moskva",
  },
  {
    text: "Мостиска",
    id: "Мостиска",
  },
  {
    text: "Мукачево",
    id: "Мукачево",
  },
  {
    text: "Муравленко",
    id: "Муравленко",
  },
  {
    text: "Мурманск",
    id: "Мурманск",
  },
  {
    text: "Муром",
    id: "Муром",
  },
  {
    text: "Мытищи",
    id: "Мытищи",
  },
  {
    text: "Мышкин",
    id: "Мышкин",
  },
  {
    text: "Набережные Челны",
    id: "Набережные Челны",
  },
  {
    text: "Навашино",
    id: "Навашино",
  },
  {
    text: "Навля",
    id: "Навля",
  },
  {
    text: "Надым",
    id: "Надым",
  },
  {
    text: "Назрань",
    id: "Назрань",
  },
  {
    text: "Нальчик",
    id: "Нальчик",
  },
  {
    text: "Наро-Фоминск",
    id: "Наро-Фоминск",
  },
  {
    text: "Нарьян-Мар",
    id: "Нарьян-Мар",
  },
  {
    text: "Научный",
    id: "Научный",
  },
  {
    text: "Нахабино",
    id: "Нахабино",
  },
  {
    text: "Находка",
    id: "Находка",
  },
  {
    text: "Невинномысск",
    id: "Невинномысск",
  },
  {
    text: "Невьянск",
    id: "Невьянск",
  },
  {
    text: "Недригайлов",
    id: "Недригайлов",
  },
  {
    text: "Нежин",
    id: "Нежин",
  },
  {
    text: "Нерехта",
    id: "Нерехта",
  },
  {
    text: "Нерюнгри",
    id: "Нерюнгри",
  },
  {
    text: "Нетишин",
    id: "Нетишин",
  },
  {
    text: "Нефтегорск",
    id: "Нефтегорск",
  },
  {
    text: "Нефтекамск",
    id: "Нефтекамск",
  },
  {
    text: "Нефтекумск",
    id: "Нефтекумск",
  },
  {
    text: "Нефтеюганск",
    id: "Нефтеюганск",
  },
  {
    text: "Нехаевский",
    id: "Нехаевский",
  },
  {
    text: "Нижневартовск",
    id: "Нижневартовск",
  },
  {
    text: "Нижнегорский",
    id: "Нижнегорский",
  },
  {
    text: "Нижнекамск",
    id: "Нижнекамск",
  },
  {
    text: "Нижнеудинск",
    id: "Нижнеудинск",
  },
  {
    text: "Нижние Серги",
    id: "Нижние Серги",
  },
  {
    text: "Нижний Архыз",
    id: "Нижний Архыз",
  },
  {
    text: "Нижний Новгород",
    id: "Нижний Новгород",
  },
  {
    text: "Нижний Тагил",
    id: "Нижний Тагил",
  },
  {
    text: "Нижняя Салда",
    id: "Нижняя Салда",
  },
  {
    text: "Нижняя Тура",
    id: "Нижняя Тура",
  },
  {
    text: "Николаев",
    id: "Николаев",
  },
  {
    text: "Николаев",
    id: "Николаев",
  },
  {
    text: "Николаевск",
    id: "Николаевск",
  },
  {
    text: "Николаевск-на-Амуре",
    id: "Николаевск-на-Амуре",
  },
  {
    text: "Никополь",
    id: "Никополь",
  },
  {
    text: "Новая Каховка",
    id: "Новая Каховка",
  },
  {
    text: "Новая Усмань",
    id: "Новая Усмань",
  },
  {
    text: "Новоалександровск",
    id: "Новоалександровск",
  },
  {
    text: "Новоаннинский",
    id: "Новоаннинский",
  },
  {
    text: "Новоархангельск",
    id: "Новоархангельск",
  },
  {
    text: "Нововолынск",
    id: "Нововолынск",
  },
  {
    text: "Нововоронеж",
    id: "Нововоронеж",
  },
  {
    text: "Новоград-Волынский",
    id: "Новоград-Волынский",
  },
  {
    text: "Новогродовка",
    id: "Новогродовка",
  },
  {
    text: "Новодвинск",
    id: "Новодвинск",
  },
  {
    text: "Новоднестровск",
    id: "Новоднестровск",
  },
  {
    text: "Новодружеск",
    id: "Новодружеск",
  },
  {
    text: "Новокубанск",
    id: "Новокубанск",
  },
  {
    text: "Новокузнецк",
    id: "Новокузнецк",
  },
  {
    text: "Новокуйбышевск",
    id: "Новокуйбышевск",
  },
  {
    text: "Новомичуринск",
    id: "Новомичуринск",
  },
  {
    text: "Новомосковск",
    id: "Новомосковск",
  },
  {
    text: "Новомосковск",
    id: "Новомосковск",
  },
  {
    text: "Новониколаевский",
    id: "Новониколаевский",
  },
  {
    text: "Новопавловск",
    id: "Новопавловск",
  },
  {
    text: "Новороссийск",
    id: "Новороссийск",
  },
  {
    text: "Новосибирск",
    id: "Новосибирск",
  },
  {
    text: "Новотроицк",
    id: "Новотроицк",
  },
  {
    text: "Новотроицкое",
    id: "Новотроицкое",
  },
  {
    text: "Новоуральск",
    id: "Новоуральск",
  },
  {
    text: "Новочебоксарск",
    id: "Новочебоксарск",
  },
  {
    text: "Новочеркасск",
    id: "Новочеркасск",
  },
  {
    text: "Новошахтинск",
    id: "Новошахтинск",
  },
  {
    text: "Новошахтинский",
    id: "Новошахтинский",
  },
  {
    text: "Новый Буг",
    id: "Новый Буг",
  },
  {
    text: "Новый Оскол",
    id: "Новый Оскол",
  },
  {
    text: "Новый Раздол",
    id: "Новый Раздол",
  },
  {
    text: "Новый Рогачик",
    id: "Новый Рогачик",
  },
  {
    text: "Новый Ургал",
    id: "Новый Ургал",
  },
  {
    text: "Новый Уренгой",
    id: "Новый Уренгой",
  },
  {
    text: "Ногинск",
    id: "Ногинск",
  },
  {
    text: "Норильск",
    id: "Норильск",
  },
  {
    text: "Носовка",
    id: "Носовка",
  },
  {
    text: "Ноябрьск",
    id: "Ноябрьск",
  },
  {
    text: "Нытва",
    id: "Нытва",
  },
  {
    text: "Обнинск",
    id: "Обнинск",
  },
  {
    text: "Обухов",
    id: "Обухов",
  },
  {
    text: "Овидиополь",
    id: "Овидиополь",
  },
  {
    text: "Овлаши",
    id: "Овлаши",
  },
  {
    text: "Овруч",
    id: "Овруч",
  },
  {
    text: "Одесса",
    id: "Одесса",
  },
  {
    text: "Одинцово",
    id: "Одинцово",
  },
  {
    text: "Озерск",
    id: "Озерск",
  },
  {
    text: "Октябрьский",
    id: "Октябрьский",
  },
  {
    text: "Октябрьский",
    id: "Октябрьский",
  },
  {
    text: "Оленегорск",
    id: "Оленегорск",
  },
  {
    text: "Ольга",
    id: "Ольга",
  },
  {
    text: "Ольховатка",
    id: "Ольховатка",
  },
  {
    text: "Омск",
    id: "Омск",
  },
  {
    text: "Оноковцы",
    id: "Оноковцы",
  },
  {
    text: "Орда",
    id: "Орда",
  },
  {
    text: "Орджоникидзе",
    id: "Орджоникидзе",
  },
  {
    text: "Орел",
    id: "Орел",
  },
  {
    text: "Оренбург",
    id: "Оренбург",
  },
  {
    text: "Орехово-Зуево",
    id: "Орехово-Зуево",
  },
  {
    text: "Орлов",
    id: "Орлов",
  },
  {
    text: "Орловский",
    id: "Орловский",
  },
  {
    text: "Орск",
    id: "Орск",
  },
  {
    text: "Оса",
    id: "Оса",
  },
  {
    text: "Отрадное",
    id: "Отрадное",
  },
  {
    text: "Очер",
    id: "Очер",
  },
  {
    text: "п. Лесной Городок",
    id: "п. Лесной Городок",
  },
  {
    text: "Павлово",
    id: "Павлово",
  },
  {
    text: "Павловский Посад",
    id: "Павловский Посад",
  },
  {
    text: "Павлоград",
    id: "Павлоград",
  },
  {
    text: "Палласовка",
    id: "Палласовка",
  },
  {
    text: "Панино",
    id: "Панино",
  },
  {
    text: "Пенза",
    id: "Пенза",
  },
  {
    text: "Первомайск",
    id: "Первомайск",
  },
  {
    text: "Первомайск",
    id: "Первомайск",
  },
  {
    text: "Первомайск",
    id: "Первомайск",
  },
  {
    text: "Первомайский",
    id: "Первомайский",
  },
  {
    text: "Первоуральск",
    id: "Первоуральск",
  },
  {
    text: "Переславль-Залесский",
    id: "Переславль-Залесский",
  },
  {
    text: "Перечин",
    id: "Перечин",
  },
  {
    text: "Переяслав-Хмельницкий",
    id: "Переяслав-Хмельницкий",
  },
  {
    text: "Пермь",
    id: "Пермь",
  },
  {
    text: "Песочин",
    id: "Песочин",
  },
  {
    text: "Песьянка",
    id: "Песьянка",
  },
  {
    text: "Петровское",
    id: "Петровское",
  },
  {
    text: "Петрозаводск",
    id: "Петрозаводск",
  },
  {
    text: "Петропавловск-Камчатский",
    id: "Петропавловск-Камчатский",
  },
  {
    text: "Печора",
    id: "Печора",
  },
  {
    text: "Пикалево",
    id: "Пикалево",
  },
  {
    text: "Пирятин",
    id: "Пирятин",
  },
  {
    text: "Питкяранта",
    id: "Питкяранта",
  },
  {
    text: "Погребище",
    id: "Погребище",
  },
  {
    text: "Подольск",
    id: "Подольск",
  },
  {
    text: "Покров",
    id: "Покров",
  },
  {
    text: "Покровка",
    id: "Покровка",
  },
  {
    text: "Покровское",
    id: "Покровское",
  },
  {
    text: "Полевской",
    id: "Полевской",
  },
  {
    text: "Полонное",
    id: "Полонное",
  },
  {
    text: "Полтава",
    id: "Полтава",
  },
  {
    text: "Помошная",
    id: "Помошная",
  },
  {
    text: "Попельня",
    id: "Попельня",
  },
  {
    text: "Поронайск",
    id: "Поронайск",
  },
  {
    text: "пос. Вешки",
    id: "пос. Вешки",
  },
  {
    text: "пос. Лесной",
    id: "пос. Лесной",
  },
  {
    text: "Прилуки",
    id: "Прилуки",
  },
  {
    text: "Приморск",
    id: "Приморск",
  },
  {
    text: "Приморско-Ахтарск",
    id: "Приморско-Ахтарск",
  },
  {
    text: "Прокопьевск",
    id: "Прокопьевск",
  },
  {
    text: "Протвино",
    id: "Протвино",
  },
  {
    text: "Прохоровка",
    id: "Прохоровка",
  },
  {
    text: "Псков",
    id: "Псков",
  },
  {
    text: "Пулково",
    id: "Пулково",
  },
  {
    text: "Пустомыты",
    id: "Пустомыты",
  },
  {
    text: "Путилково",
    id: "Путилково",
  },
  {
    text: "Пушкино",
    id: "Пушкино",
  },
  {
    text: "Пущино",
    id: "Пущино",
  },
  {
    text: "Пыть-ях",
    id: "Пыть-ях",
  },
  {
    text: "Пятигорск",
    id: "Пятигорск",
  },
  {
    text: "Радомышль",
    id: "Радомышль",
  },
  {
    text: "Радужный",
    id: "Радужный",
  },
  {
    text: "Радужный",
    id: "Радужный",
  },
  {
    text: "Раздельная",
    id: "Раздельная",
  },
  {
    text: "Раменское",
    id: "Раменское",
  },
  {
    text: "Рахов",
    id: "Рахов",
  },
  {
    text: "Ревда",
    id: "Ревда",
  },
  {
    text: "Ремонтное",
    id: "Ремонтное",
  },
  {
    text: "Репки",
    id: "Репки",
  },
  {
    text: "Репьевка",
    id: "Репьевка",
  },
  {
    text: "Реутов",
    id: "Реутов",
  },
  {
    text: "Ржакса",
    id: "Ржакса",
  },
  {
    text: "Ровеньки",
    id: "Ровеньки",
  },
  {
    text: "Ровно",
    id: "Ровно",
  },
  {
    text: "Рогатин",
    id: "Рогатин",
  },
  {
    text: "Родионово-Несветайская",
    id: "Родионово-Несветайская",
  },
  {
    text: "Рожище",
    id: "Рожище",
  },
  {
    text: "Рокитное",
    id: "Рокитное",
  },
  {
    text: "Романовская",
    id: "Романовская",
  },
  {
    text: "Ромны",
    id: "Ромны",
  },
  {
    text: "Рославль",
    id: "Рославль",
  },
  {
    text: "Россошь",
    id: "Россошь",
  },
  {
    text: "Ростов",
    id: "Ростов",
  },
  {
    text: "Ростов-на-Дону",
    id: "Ростов-на-Дону",
  },
  {
    text: "Рубежное",
    id: "Рубежное",
  },
  {
    text: "Рубцовск",
    id: "Рубцовск",
  },
  {
    text: "Рудня",
    id: "Рудня",
  },
  {
    text: "Руза",
    id: "Руза",
  },
  {
    text: "Рузаевка",
    id: "Рузаевка",
  },
  {
    text: "Румянцево",
    id: "Румянцево",
  },
  {
    text: "Рыбинск",
    id: "Рыбинск",
  },
  {
    text: "Ряжск",
    id: "Ряжск",
  },
  {
    text: "Рязань",
    id: "Рязань",
  },
  {
    text: "Саки",
    id: "Саки",
  },
  {
    text: "Салават",
    id: "Салават",
  },
  {
    text: "Салехард",
    id: "Салехард",
  },
  {
    text: "Салым",
    id: "Салым",
  },
  {
    text: "Сальск",
    id: "Сальск",
  },
  {
    text: "Самара",
    id: "Самара",
  },
  {
    text: "Санкт-Петербург",
    id: "Санкт-Петербург",
  },
  {
    text: "Саракташ",
    id: "Саракташ",
  },
  {
    text: "Саранск",
    id: "Саранск",
  },
  {
    text: "Сарапул",
    id: "Сарапул",
  },
  {
    text: "Саратов",
    id: "Саратов",
  },
  {
    text: "Сарны",
    id: "Сарны",
  },
  {
    text: "Саров",
    id: "Саров",
  },
  {
    text: "Сатка",
    id: "Сатка",
  },
  {
    text: "Сафоново",
    id: "Сафоново",
  },
  {
    text: "Саяногорск",
    id: "Саяногорск",
  },
  {
    text: "Свалява",
    id: "Свалява",
  },
  {
    text: "Сватово",
    id: "Сватово",
  },
  {
    text: "Свердловск",
    id: "Свердловск",
  },
  {
    text: "Свесса",
    id: "Свесса",
  },
  {
    text: "Светловодск",
    id: "Светловодск",
  },
  {
    text: "Светлогорск",
    id: "Светлогорск",
  },
  {
    text: "Светлоград",
    id: "Светлоград",
  },
  {
    text: "Светлый",
    id: "Светлый",
  },
  {
    text: "Светлый Яр",
    id: "Светлый Яр",
  },
  {
    text: "Свободный",
    id: "Свободный",
  },
  {
    text: "Севастополь",
    id: "Севастополь",
    code: "sevastopol",
  },
  {
    text: "Северобайкальск",
    id: "Северобайкальск",
  },
  {
    text: "Северодвинск",
    id: "Северодвинск",
  },
  {
    text: "Северодонецк",
    id: "Северодонецк",
  },
  {
    text: "Северск",
    id: "Северск",
  },
  {
    text: "Сегежа",
    id: "Сегежа",
  },
  {
    text: "Селидово",
    id: "Селидово",
  },
  {
    text: "Селятино",
    id: "Селятино",
  },
  {
    text: "Семенов",
    id: "Семенов",
  },
  {
    text: "Семикаракорск",
    id: "Семикаракорск",
  },
  {
    text: "Сергач",
    id: "Сергач",
  },
  {
    text: "Сергиев Посад",
    id: "Сергиев Посад",
  },
  {
    text: "Серебряные Пруды",
    id: "Серебряные Пруды",
  },
  {
    text: "Серов",
    id: "Серов",
  },
  {
    text: "Серпухов",
    id: "Серпухов",
  },
  {
    text: "Сертолово",
    id: "Сертолово",
  },
  {
    text: "Сестрорецк",
    id: "Сестрорецк",
  },
  {
    text: "Сибай",
    id: "Сибай",
  },
  {
    text: "Симферополь",
    id: "Симферополь",
  },
  {
    text: "Синельниково",
    id: "Синельниково",
  },
  {
    text: "Скадовск",
    id: "Скадовск",
  },
  {
    text: "Сковородино",
    id: "Сковородино",
  },
  {
    text: "Славута",
    id: "Славута",
  },
  {
    text: "Славутич",
    id: "Славутич",
  },
  {
    text: "Славянка",
    id: "Славянка",
  },
  {
    text: "Славянск",
    id: "Славянск",
  },
  {
    text: "Славянск-на-Кубани",
    id: "Славянск-на-Кубани",
  },
  {
    text: "Смела",
    id: "Смела",
  },
  {
    text: "Смоленск",
    id: "Смоленск",
  },
  {
    text: "Снежинск",
    id: "Снежинск",
  },
  {
    text: "Снежное",
    id: "Снежное",
  },
  {
    text: "Снятын",
    id: "Снятын",
  },
  {
    text: "Собинка",
    id: "Собинка",
  },
  {
    text: "Советск",
    id: "Советск",
  },
  {
    text: "Советская Гавань",
    id: "Советская Гавань",
  },
  {
    text: "Советский",
    id: "Советский",
  },
  {
    text: "Совхоз имени Ленина",
    id: "Совхоз имени Ленина",
  },
  {
    text: "Сокаль",
    id: "Сокаль",
  },
  {
    text: "Сокиряны",
    id: "Сокиряны",
  },
  {
    text: "Соликамск",
    id: "Соликамск",
  },
  {
    text: "Солнечная Долина",
    id: "Солнечная Долина",
  },
  {
    text: "Солнечногорск",
    id: "Солнечногорск",
  },
  {
    text: "Солоницевка",
    id: "Солоницевка",
  },
  {
    text: "Сортавала",
    id: "Сортавала",
  },
  {
    text: "Сосновоборск",
    id: "Сосновоборск",
  },
  {
    text: "Сосновый Бор",
    id: "Сосновый Бор",
  },
  {
    text: "Сочи",
    id: "Сочи",
  },
  {
    text: "Спасск-Дальний",
    id: "Спасск-Дальний",
  },
  {
    text: "Средняя Ахтуба",
    id: "Средняя Ахтуба",
  },
  {
    text: "Ставрополь",
    id: "Ставрополь",
  },
  {
    text: "Старая Выжевка",
    id: "Старая Выжевка",
  },
  {
    text: "Старая Купавна",
    id: "Старая Купавна",
  },
  {
    text: "Старая Полтавка",
    id: "Старая Полтавка",
  },
  {
    text: "Старая Русса",
    id: "Старая Русса",
  },
  {
    text: "Старая Чара",
    id: "Старая Чара",
  },
  {
    text: "Старобельск",
    id: "Старобельск",
  },
  {
    text: "Староконстантинов",
    id: "Староконстантинов",
  },
  {
    text: "Старый Оскол",
    id: "Старый Оскол",
  },
  {
    text: "Стаханов",
    id: "Стаханов",
  },
  {
    text: "Степное",
    id: "Степное",
  },
  {
    text: "Стерлитамак",
    id: "Стерлитамак",
  },
  {
    text: "Стрежевой",
    id: "Стрежевой",
  },
  {
    text: "Стрый",
    id: "Стрый",
  },
  {
    text: "Ступино",
    id: "Ступино",
  },
  {
    text: "Суворов",
    id: "Суворов",
  },
  {
    text: "Судак",
    id: "Судак",
  },
  {
    text: "Сумы",
    id: "Сумы",
  },
  {
    text: "Сургут",
    id: "Сургут",
  },
  {
    text: "Сухой Лог",
    id: "Сухой Лог",
  },
  {
    text: "Сходня",
    id: "Сходня",
  },
  {
    text: "Сызрань",
    id: "Сызрань",
  },
  {
    text: "Сыктывкар",
    id: "Сыктывкар",
  },
  {
    text: "Сысерть",
    id: "Сысерть",
  },
  {
    text: "Таврийск",
    id: "Таврийск",
  },
  {
    text: "Таганрог",
    id: "Таганрог",
  },
  {
    text: "Тайга",
    id: "Тайга",
  },
  {
    text: "Тайшет",
    id: "Тайшет",
  },
  {
    text: "Таксимо",
    id: "Таксимо",
  },
  {
    text: "Тамбов",
    id: "Тамбов",
  },
  {
    text: "Тарасовский",
    id: "Тарасовский",
  },
  {
    text: "Тарко-сале",
    id: "Тарко-сале",
  },
  {
    text: "Татищево",
    id: "Татищево",
  },
  {
    text: "Таштагол",
    id: "Таштагол",
  },
  {
    text: "Тверь",
    id: "Тверь",
  },
  {
    text: "Тейково",
    id: "Тейково",
  },
  {
    text: "Темрюк",
    id: "Темрюк",
  },
  {
    text: "Теофиполь",
    id: "Теофиполь",
  },
  {
    text: "Теплодар",
    id: "Теплодар",
  },
  {
    text: "Терней",
    id: "Терней",
  },
  {
    text: "Терновка",
    id: "Терновка",
  },
  {
    text: "Тернополь",
    id: "Тернополь",
  },
  {
    text: "Тимашевск",
    id: "Тимашевск",
  },
  {
    text: "Тихвин",
    id: "Тихвин",
  },
  {
    text: "Тихорецк",
    id: "Тихорецк",
  },
  {
    text: "Тлумач",
    id: "Тлумач",
  },
  {
    text: "Тобольск",
    id: "Тобольск",
  },
  {
    text: "Токмак",
    id: "Токмак",
  },
  {
    text: "Тольятти",
    id: "Тольятти",
  },
  {
    text: "Томилино",
    id: "Томилино",
  },
  {
    text: "Томск",
    id: "Томск",
  },
  {
    text: "Топки",
    id: "Топки",
  },
  {
    text: "Торез",
    id: "Торез",
  },
  {
    text: "Тосно",
    id: "Тосно",
  },
  {
    text: "Трехгорный",
    id: "Трехгорный",
  },
  {
    text: "Троицк",
    id: "Троицк",
  },
  {
    text: "Троицк",
    id: "Троицк",
  },
  {
    text: "Трудовое",
    id: "Трудовое",
  },
  {
    text: "Трускавец",
    id: "Трускавец",
  },
  {
    text: "Туапсе",
    id: "Туапсе",
  },
  {
    text: "Туймазы",
    id: "Туймазы",
  },
  {
    text: "Тула",
    id: "Тула",
  },
  {
    text: "Тутаев",
    id: "Тутаев",
  },
  {
    text: "Тымовское",
    id: "Тымовское",
  },
  {
    text: "Тында",
    id: "Тында",
  },
  {
    text: "Тюмень",
    id: "Тюмень",
  },
  {
    text: "Тячев",
    id: "Тячев",
  },
  {
    text: "Увельский",
    id: "Увельский",
  },
  {
    text: "Угледар",
    id: "Угледар",
  },
  {
    text: "Углич",
    id: "Углич",
  },
  {
    text: "Удомля",
    id: "Удомля",
  },
  {
    text: "Ужгород",
    id: "Ужгород",
  },
  {
    text: "Узин",
    id: "Узин",
  },
  {
    text: "Украинка",
    id: "Украинка",
  },
  {
    text: "Укромное",
    id: "Укромное",
  },
  {
    text: "Улан-Удэ",
    id: "Улан-Удэ",
  },
  {
    text: "Ульяновск",
    id: "Ульяновск",
  },
  {
    text: "Умань",
    id: "Умань",
  },
  {
    text: "Унеча",
    id: "Унеча",
  },
  {
    text: "Урай",
    id: "Урай",
  },
  {
    text: "Урень",
    id: "Урень",
  },
  {
    text: "Урюпинск",
    id: "Урюпинск",
  },
  {
    text: "Усинск",
    id: "Усинск",
  },
  {
    text: "Уссурийск",
    id: "Уссурийск",
  },
  {
    text: "Усть-Илимск",
    id: "Усть-Илимск",
  },
  {
    text: "Усть-Катав",
    id: "Усть-Катав",
  },
  {
    text: "Усть-Кинельский",
    id: "Усть-Кинельский",
  },
  {
    text: "Усть-Кут",
    id: "Усть-Кут",
  },
  {
    text: "Уфа",
    id: "Уфа",
    code: "ufa",
  },
  {
    text: "Ухта",
    id: "Ухта",
  },
  {
    text: "Учалы",
    id: "Учалы",
  },
  {
    text: "Фастов",
    id: "Фастов",
  },
  {
    text: "Феодосия",
    id: "Феодосия",
  },
  {
    text: "Фокино",
    id: "Фокино",
  },
  {
    text: "Фролово",
    id: "Фролово",
  },
  {
    text: "Фрязево",
    id: "Фрязево",
  },
  {
    text: "Фрязино",
    id: "Фрязино",
  },
  {
    text: "Хабаровск",
    id: "Хабаровск",
  },
  {
    text: "Ханты-Мансийск",
    id: "Ханты-Мансийск",
  },
  {
    text: "Харцызск",
    id: "Харцызск",
  },
  {
    text: "Харьков",
    id: "Харьков",
  },
  {
    text: "Хасавюрт",
    id: "Хасавюрт",
  },
  {
    text: "Херсон",
    id: "Херсон",
  },
  {
    text: "Хилок",
    id: "Хилок",
  },
  {
    text: "Химки",
    id: "Химки",
  },
  {
    text: "Хмельник",
    id: "Хмельник",
  },
  {
    text: "Хмельницкий",
    id: "Хмельницкий",
  },
  {
    text: "Холмск",
    id: "Холмск",
  },
  {
    text: "Хороль",
    id: "Хороль",
  },
  {
    text: "Хуст",
    id: "Хуст",
  },
  {
    text: "Целина",
    id: "Целина",
  },
  {
    text: "Цимлянск",
    id: "Цимлянск",
  },
  {
    text: "Цюрупинск",
    id: "Цюрупинск",
  },
  {
    text: "Чайковский",
    id: "Чайковский",
  },
  {
    text: "Чалтырь",
    id: "Чалтырь",
  },
  {
    text: "Чамзинка",
    id: "Чамзинка",
  },
  {
    text: "Чапаевск",
    id: "Чапаевск",
  },
  {
    text: "Чебаркуль",
    id: "Чебаркуль",
  },
  {
    text: "Чебоксары",
    id: "Чебоксары",
  },
  {
    text: "Чегдомын",
    id: "Чегдомын",
  },
  {
    text: "Челябинск",
    id: "Челябинск",
  },
  {
    text: "Червоноград",
    id: "Червоноград",
  },
  {
    text: "Череповец",
    id: "Череповец",
  },
  {
    text: "Черкассы",
    id: "Черкассы",
  },
  {
    text: "Черкесск",
    id: "Черкесск",
  },
  {
    text: "Черневцы",
    id: "Черневцы",
  },
  {
    text: "Чернигов",
    id: "Чернигов",
  },
  {
    text: "Черниговка",
    id: "Черниговка",
  },
  {
    text: "Чернобай",
    id: "Чернобай",
  },
  {
    text: "Чернобыль",
    id: "Чернобыль",
  },
  {
    text: "Черновцы",
    id: "Черновцы",
  },
  {
    text: "Черноголовка",
    id: "Черноголовка",
  },
  {
    text: "Черногорск",
    id: "Черногорск",
  },
  {
    text: "Чернушка",
    id: "Чернушка",
  },
  {
    text: "Чернышевск",
    id: "Чернышевск",
  },
  {
    text: "Черняховск",
    id: "Черняховск",
  },
  {
    text: "Чертково",
    id: "Чертково",
  },
  {
    text: "Чехов",
    id: "Чехов",
  },
  {
    text: "Чита",
    id: "Чита",
  },
  {
    text: "Чугуев",
    id: "Чугуев",
  },
  {
    text: "Чудово",
    id: "Чудово",
  },
  {
    text: "Чусовой",
    id: "Чусовой",
  },
  {
    text: "Шадринск",
    id: "Шадринск",
  },
  {
    text: "Шаргород",
    id: "Шаргород",
  },
  {
    text: "Шарыпово",
    id: "Шарыпово",
  },
  {
    text: "Шарья",
    id: "Шарья",
  },
  {
    text: "Шатура",
    id: "Шатура",
  },
  {
    text: "Шахтёрск",
    id: "Шахтёрск",
  },
  {
    text: "Шахты",
    id: "Шахты",
  },
  {
    text: "Шахунья",
    id: "Шахунья",
  },
  {
    text: "Шацк",
    id: "Шацк",
  },
  {
    text: "Шебекино",
    id: "Шебекино",
  },
  {
    text: "Шелехов",
    id: "Шелехов",
  },
  {
    text: "Шепетовка",
    id: "Шепетовка",
  },
  {
    text: "Шерегеш",
    id: "Шерегеш",
  },
  {
    text: "Шилка",
    id: "Шилка",
  },
  {
    text: "Шимановск",
    id: "Шимановск",
  },
  {
    text: "Шостка",
    id: "Шостка",
  },
  {
    text: "Шумерля",
    id: "Шумерля",
  },
  {
    text: "Шумиха",
    id: "Шумиха",
  },
  {
    text: "Щёлкино",
    id: "Щёлкино",
  },
  {
    text: "Щелково",
    id: "Щелково",
  },
  {
    text: "Щербинка",
    id: "Щербинка",
  },
  {
    text: "Щорс",
    id: "Щорс",
  },
  {
    text: "Электрогорск",
    id: "Электрогорск",
  },
  {
    text: "Электросталь",
    id: "Электросталь",
  },
  {
    text: "Электроугли",
    id: "Электроугли",
  },
  {
    text: "Элиста",
    id: "Элиста",
  },
  {
    text: "Энгельс",
    id: "Энгельс",
  },
  {
    text: "Энергодар",
    id: "Энергодар",
  },
  {
    text: "Юбилейный",
    id: "Юбилейный",
  },
  {
    text: "Югорск",
    id: "Югорск",
  },
  {
    text: "Южно-Сахалинск",
    id: "Южно-Сахалинск",
  },
  {
    text: "Южное",
    id: "Южное",
  },
  {
    text: "Южноукраинск",
    id: "Южноукраинск",
  },
  {
    text: "Южноуральск",
    id: "Южноуральск",
  },
  {
    text: "Юрга",
    id: "Юрга",
  },
  {
    text: "Юрюзань",
    id: "Юрюзань",
  },
  {
    text: "Яворов",
    id: "Яворов",
  },
  {
    text: "Яготин",
    id: "Яготин",
  },
  {
    text: "Ядрин",
    id: "Ядрин",
  },
  {
    text: "Яковлевка",
    id: "Яковлевка",
  },
  {
    text: "Якутск",
    id: "Якутск",
  },
  {
    text: "Ялта",
    id: "Ялта",
  },
  {
    text: "Янаул",
    id: "Янаул",
  },
  {
    text: "Яранск",
    id: "Яранск",
  },
  {
    text: "Яремче",
    id: "Яремче",
  },
  {
    text: "Ярославль",
    id: "Ярославль",
  },
  {
    text: "Ярцево",
    id: "Ярцево",
  },
  {
    text: "Ясиноватая",
    id: "Ясиноватая",
  },
  {
    text: "Ясный",
    id: "Ясный",
  },
  {
    text: "Яхрома",
    id: "Яхрома",
  },
];
console.log(binarySearch2(cities, "moskov"));

/////////////////////////////////////////// assets functions  //////////////////////////////////

function randomWord() {
  let templateWord = "abcdefghijklmnopqrstuvwxyz";
  let word = "";
  for (let i = 0; i < 7; i++) {
    let index = Math.floor(Math.random() * templateWord.length);
    word += templateWord[index];
  }
  return word;
}

function generateArrayNames(countNames) {
  let resultArray = [];
  for (let i = 0; i < countNames; i++) {
    let word = randomWord();
    resultArray.push(word);
  }
  return resultArray.sort();
}
